In [4]:
import numpy as np
import pandas as pd

### Group By
Ergebnismenge gruppieren und darauf Aggregationen anwenden

In [5]:
data = {'Firma': ['Google','Google','Microsoft','Microsoft','Facebook','Facebook'],
        'Person': ['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
         'Sales': [200,120,340,124,243,350]}

In [6]:
df = pd.DataFrame(data)
df

       Firma   Person  Sales
0     Google      Sam    200
1     Google  Charlie    120
2  Microsoft      Amy    340
3  Microsoft  Vanessa    124
4   Facebook     Carl    243
5   Facebook    Sarah    350

In [7]:
df.groupby('Firma').mean() #Zeilen gruppieren

           Sales
Firma
Facebook   296.5
Google     160.0
Microsoft  232.0

In [8]:
nach_firma = df.groupby('Firma')

In [9]:
nach_firma.count() #mean,std,min,max,count mögl.

           Person  Sales
Firma
Facebook        2      2
Google          2      2
Microsoft       2      2

In [10]:
nach_firma.describe() #mit .transpose() nach describe -> andere Darstellung, ähnlich summary(nach_firma) in R

          Sales
          count   mean         std    min     25%    50%     75%    max
Firma
Facebook    2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
Google      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
Microsoft   2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [11]:
nach_firma.describe().transpose()['Google']

Sales  count      2.000000
       mean     160.000000
       std       56.568542
       min      120.000000
       25%      140.000000
       50%      160.000000
       75%      180.000000
       max      200.000000
Name: Google, dtype: float64

### Zusammenführen von Data Frames (Concatenating, Merging, Joining)
es gibt 3 Mögl. um Data Frames zusammenzuführen

In [12]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

#### Concatenating
zusammenfügen an einer Achse

In [13]:
pd.concat([df1, df2, df3]) #verknüpfen der DF durch anfügen in der angegebenen Reihenfolge zeilenweise

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [14]:
pd.concat([df1, df2, df3], axis=1) #spaltenweise anfügen

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

#### Merging
ählich JOIN im SQL, 3 mögl. Methoden unter dem attr. how um DF zusammenzuführen

brauche eine gemeinsame Spalte als Basis

In [15]:
links = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
rechts = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})    
links #beide haben die gleiche Spalte (key) mit den gleichen Werten

    A   B key
0  A0  B0  K0
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [16]:
pd.merge(links, rechts, how='inner', on='key') #inner = default, mergen nach key Spalte

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A1  B1  K1  C1  D1
2  A2  B2  K2  C2  D2
3  A3  B3  K3  C3  D3

In [17]:
links = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
rechts = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})
links # nun 2 key Spalten

    A   B key1 key2
0  A0  B0   K0   K0
1  A1  B1   K0   K1
2  A2  B2   K1   K0
3  A3  B3   K2   K1

In [18]:
pd.merge(links, rechts, how='inner', on=['key1','key2']) #mergen nach 2 Spalten, aber nur Zeilen die beide haben

    A   B key1 key2   C   D
0  A0  B0   K0   K0  C0  D0
1  A2  B2   K1   K0  C1  D1
2  A2  B2   K1   K0  C2  D2

In [19]:
pd.merge(links, rechts, how='outer', on=['key1','key2']) #beide Key gemerget, jedoch mit Null Values

     A    B key1 key2    C    D
0   A0   B0   K0   K0   C0   D0
1   A1   B1   K0   K1  NaN  NaN
2   A2   B2   K1   K0   C1   D1
3   A2   B2   K1   K0   C2   D2
4   A3   B3   K2   K1  NaN  NaN
5  NaN  NaN   K2   K0   C3   D3

In [20]:
pd.merge(links, rechts, how='right', on=['key1','key2']) #keine Null Values für das rechte DF, left auch mögl.

     A    B key1 key2   C   D
0   A0   B0   K0   K0  C0  D0
1   A2   B2   K1   K0  C1  D1
2   A2   B2   K1   K0  C2  D2
3  NaN  NaN   K2   K0  C3  D3

#### Joining
Spalten mit zwei potentiell unterschiedlichen indizierten Data Frames in einen gemeinsamen Data Frame packen

In [21]:
links = pd.DataFrame({'A': ['A0', 'A1', 'A2'],
                     'B': ['B0', 'B1', 'B2']},
                      index=['K0', 'K1', 'K2']) 

rechts = pd.DataFrame({'C': ['C0', 'C2', 'C3'],
                    'D': ['D0', 'D2', 'D3']},
                      index=['K0', 'K2', 'K3'])
links

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [22]:
rechts #unterschiedliche Spalten k1 und k3

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [23]:
links.join(rechts) #an das linke DF das rechte anfügen, K3 wird nicht mit berückstigt, weil bei links nicht vorhanden

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [24]:
links.join(rechts, how='outer') #alle Kombinationen

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

### Duplikate
https://www.youtube.com/watch?v=ht5buXUMqkQ

In [25]:
links['A'].duplicated() #Duplikate würde ein True zurück geben

K0    False
K1    False
K2    False
Name: A, dtype: bool

In [ ]:
links.drop_duplicates(keep='first') #falls Duplikate vorhanden sind, kann man diese löschen, keep -> first, last oder False

### Operationen auf ein Data Frame

In [26]:
df = pd.DataFrame({'spa1':[1,2,3,4],'spa2':[444,555,666,444],'spa3':['abc','def','ghi','xyz']})
df.head() #zeigt nur die ersten paar Zeilen

   spa1  spa2 spa3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [27]:
df['spa2'].unique() #einzig artige Werte

array([444, 555, 666], dtype=int64)

In [28]:
df['spa2'].nunique() #Anzahl einzigartiger Werte

3

In [29]:
df['spa2'].value_counts() #zählt die absolute Häufigkeit von Werten

444    2
555    1
666    1
Name: spa2, dtype: int64

In [30]:
newdf = df[(df['spa1'] > 2)]
newdf

   spa1  spa2 spa3
2     3   666  ghi
3     4   444  xyz

In [31]:
newdf = df[(df['spa1'] > 2) & (df['spa2'] == 444)]
newdf

   spa1  spa2 spa3
3     4   444  xyz

#### Funktionen anweden

In [32]:
mal2 = lambda x: x*2

In [33]:
df['spa1'].apply(mal2) #mit apply kann man auf Spalten eine Fkt. anwenden

0    2
1    4
2    6
3    8
Name: spa1, dtype: int64

In [34]:
df['spa1'].apply(lambda x: x*2) #2. Mögl

0    2
1    4
2    6
3    8
Name: spa1, dtype: int64

In [35]:
df['spa3'].apply(len) # von Strings in der Zeile die Länge berechnen

0    3
1    3
2    3
3    3
Name: spa3, dtype: int64

In [36]:
df['spa1'].sum()

10

#### Spalten & Zeilen entfernen

In [37]:
df.drop('spa1', axis=1) #Spalte entfernen -> inplace

   spa2 spa3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [38]:
df.drop(1, axis=0) #Zeile entfernen -> inplace

   spa1  spa2 spa3
0     1   444  abc
2     3   666  ghi
3     4   444  xyz

In [39]:
del df['spa1']#dauerhafte Entfernung einer Spalte

In [40]:
df.columns # Ausgabe der Spalten

Index(['spa2', 'spa3'], dtype='object')

In [41]:
df.index #Zeilenbezeichner ausgebe

RangeIndex(start=0, stop=4, step=1)

#### Data Frame sortieren

In [42]:
df.sort_values(by="spa2") #bei Angabe inplace = True wird der Spaltenindex mit verändert

   spa2 spa3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

In [43]:
df.isnull() #Ausgabe ob Nullwerte enthalten

    spa2   spa3
0  False  False
1  False  False
2  False  False
3  False  False

In [44]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
       'B':['one','one','two','two','one','one'],
       'C': ['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}
df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [45]:
df.pivot_table(values='D', index=['A','B'], columns=['C']) #index = Liste von Spalten

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN